tutorials-pM4F/constantVelocityFoam/phreeqcRM/calciteDissolutionWithThermEquilibrium/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu 		mu [1 -1 -1 0 0 0 0] 1e-3;

fluidProperties
{
	densityModel constantDensity;

	constantDensityCoeffs
	{
		rho0         rho0   [ 1 -3 0 0 0 0 0 ] 1000;
	}

	viscosityModel constantViscosity;

	constantViscosityCoeffs
	{
		nu0         nu0   [ 0 2 -1 0 0 0 0 ] 1e-6;
	}

}

geochemicalModel phreeqcRM;

// ************************************************************************* //

geochemicalProperties
{

 mineral (Calcite);

 absolutePermeabilityModel heterogeneousScalarConstant; 
 heterogeneousScalarConstantCoeffs
 {
        K0 K0 [0 2 0 0 0 0 0] 1.e-11;
 }

 dispersionModel linearDispersion;
 linearDispersionCoeffs
 {
        Di              Di  [0 2 -1 0 0 0 0] 1e-9;
        alphaL          alphaL [0 1 0 0 0 0 0] 1e-4;
        alphaT          alphaT [0 1 0 0 0 0 0] 0;
 }


 CalciteProperties
 {
        activatePhaseEquilibrium true;
        rhos rhos [1 -3 0 0 0 0 0] 2707;
        Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
        surfaceAreaModel none;
 }

 phreeqcRM
 {
        PhreeqcInputFile "phreeqcInput"; 
        PhreeqcDataBase  "phreeqc.dat";
        use_SNIA false;
        activateUpdatePorosity false;
        StrangSteps 6;
 }
}
